MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ192GB108/mcu.h
#define _CNPU5_CN64PUE_POSITION                  0x00000000
#define _CNPU5_CN64PUE_MASK                      0x00000001
#define _CNPU5_CN64PUE_LENGTH                    0x00000001

#define _CNPU5_CN65PUE_POSITION                  0x00000001
#define _CNPU5_CN65PUE_MASK                      0x00000002
#define _CNPU5_CN65PUE_LENGTH                    0x00000001

#define _CNPU5_CN66PUE_POSITION                  0x00000002
#define _CNPU5_CN66PUE_MASK                      0x00000004
#define _CNPU5_CN66PUE_LENGTH                    0x00000001

#define _CNPU5_CN67PUE_POSITION                  0x00000003
#define _CNPU5_CN67PUE_MASK                      0x00000008
#define _CNPU5_CN67PUE_LENGTH                    0x00000001

#define _CNPU5_CN68PUE_POSITION                  0x00000004
#define _CNPU5_CN68PUE_MASK                      0x00000010
#define _CNPU5_CN68PUE_LENGTH                    0x00000001

#define _CNPU5_CN69PUE_POSITION                  0x00000005
#define _CNPU5_CN69PUE_MASK                      0x00000020
#define _CNPU5_CN69PUE_LENGTH                    0x00000001

#define _CNPU5_CN70PUE_POSITION                  0x00000006
#define _CNPU5_CN70PUE_MASK                      0x00000040
#define _CNPU5_CN70PUE_LENGTH                    0x00000001

#define _CNPU5_CN71PUE_POSITION                  0x00000007
#define _CNPU5_CN71PUE_MASK                      0x00000080
#define _CNPU5_CN71PUE_LENGTH                    0x00000001

#define _CNPU5_CN74PUE_POSITION                  0x0000000A
#define _CNPU5_CN74PUE_MASK                      0x00000400
#define _CNPU5_CN74PUE_LENGTH                    0x00000001

#define _CNPU5_CN77PUE_POSITION                  0x0000000D
#define _CNPU5_CN77PUE_MASK                      0x00002000
#define _CNPU5_CN77PUE_LENGTH                    0x00000001

#define _CNPU5_CN78PUE_POSITION                  0x0000000E
#define _CNPU5_CN78PUE_MASK                      0x00004000
#define _CNPU5_CN78PUE_LENGTH                    0x00000001

#define _INTCON1_OSCFAIL_POSITION                0x00000001
#define _INTCON1_OSCFAIL_MASK                    0x00000002
#define _INTCON1_OSCFAIL_LENGTH                  0x00000001

#define _INTCON1_STKERR_POSITION                 0x00000002
#define _INTCON1_STKERR_MASK                     0x00000004
#define _INTCON1_STKERR_LENGTH                   0x00000001

#define _INTCON1_ADDRERR_POSITION                0x00000003
#define _INTCON1_ADDRERR_MASK                    0x00000008
#define _INTCON1_ADDRERR_LENGTH                  0x00000001

#define _INTCON1_MATHERR_POSITION                0x00000004
#define _INTCON1_MATHERR_MASK                    0x00000010
#define _INTCON1_MATHERR_LENGTH                  0x00000001

#define _INTCON1_NSTDIS_POSITION                 0x0000000F
#define _INTCON1_NSTDIS_MASK                     0x00008000
#define _INTCON1_NSTDIS_LENGTH                   0x00000001

#define _INTCON2_INT0EP_POSITION                 0x00000000
#define _INTCON2_INT0EP_MASK                     0x00000001
#define _INTCON2_INT0EP_LENGTH                   0x00000001

#define _INTCON2_INT1EP_POSITION                 0x00000001
#define _INTCON2_INT1EP_MASK                     0x00000002
#define _INTCON2_INT1EP_LENGTH                   0x00000001

#define _INTCON2_INT2EP_POSITION                 0x00000002
#define _INTCON2_INT2EP_MASK                     0x00000004
#define _INTCON2_INT2EP_LENGTH                   0x00000001

#define _INTCON2_INT3EP_POSITION                 0x00000003
#define _INTCON2_INT3EP_MASK                     0x00000008
#define _INTCON2_INT3EP_LENGTH                   0x00000001

#define _INTCON2_INT4EP_POSITION                 0x00000004
#define _INTCON2_INT4EP_MASK                     0x00000010
#define _INTCON2_INT4EP_LENGTH                   0x00000001

#define _INTCON2_DISI_POSITION                   0x0000000E
#define _INTCON2_DISI_MASK                       0x00004000
#define _INTCON2_DISI_LENGTH                     0x00000001

#define _INTCON2_ALTIVT_POSITION                 0x0000000F
#define _INTCON2_ALTIVT_MASK                     0x00008000
#define _INTCON2_ALTIVT_LENGTH                   0x00000001

#define _IFS0_INT0IF_POSITION                    0x00000000
#define _IFS0_INT0IF_MASK                        0x00000001
#define _IFS0_INT0IF_LENGTH                      0x00000001

#define _IFS0_IC1IF_POSITION                     0x00000001
#define _IFS0_IC1IF_MASK                         0x00000002
#define _IFS0_IC1IF_LENGTH                       0x00000001

#define _IFS0_OC1IF_POSITION                     0x00000002
#define _IFS0_OC1IF_MASK                         0x00000004
#define _IFS0_OC1IF_LENGTH                       0x00000001

#define _IFS0_T1IF_POSITION                      0x00000003
#define _IFS0_T1IF_MASK                          0x00000008
#define _IFS0_T1IF_LENGTH                        0x00000001

#define _IFS0_IC2IF_POSITION                     0x00000005
#define _IFS0_IC2IF_MASK                         0x00000020
#define _IFS0_IC2IF_LENGTH                       0x00000001

#define _IFS0_OC2IF_POSITION                     0x00000006
#define _IFS0_OC2IF_MASK                         0x00000040
#define _IFS0_OC2IF_LENGTH                       0x00000001

#define _IFS0_T2IF_POSITION                      0x00000007
#define _IFS0_T2IF_MASK                          0x00000080
#define _IFS0_T2IF_LENGTH                        0x00000001

#define _IFS0_T3IF_POSITION                      0x00000008
#define _IFS0_T3IF_MASK                          0x00000100
#define _IFS0_T3IF_LENGTH                        0x00000001

#define _IFS0_SPF1IF_POSITION                    0x00000009
#define _IFS0_SPF1IF_MASK                        0x00000200
#define _IFS0_SPF1IF_LENGTH                      0x00000001

#define _IFS0_SPI1IF_POSITION                    0x0000000A
#define _IFS0_SPI1IF_MASK                        0x00000400
#define _IFS0_SPI1IF_LENGTH                      0x00000001

#define _IFS0_U1RXIF_POSITION                    0x0000000B
#define _IFS0_U1RXIF_MASK                        0x00000800
#define _IFS0_U1RXIF_LENGTH                      0x00000001

#define _IFS0_U1TXIF_POSITION                    0x0000000C
#define _IFS0_U1TXIF_MASK                        0x00001000
#define _IFS0_U1TXIF_LENGTH                      0x00000001

